<?php

return array(

	/*
	|--------------------------------------------------------------------------
	| アプリケーションパス
	|--------------------------------------------------------------------------
	|
	| ここではアプリケーションディレクトリーのパスを定義しています。
	| 大抵のアプリケーションではデフォルトで完全に上手く動作するので、
	| 変更する必要は全くありません。
	|
	*/

	'app' => __DIR__.'/../app',

	/*
	|--------------------------------------------------------------------------
	| Publicパス
	|--------------------------------------------------------------------------
	|
	| publicパスはJavascriptやCSSファイルのようなWebアプリ
	| ケーションの資産で構成されています。また、外部からアプリケーションへ
	| Webリクエストを送る場合の主なエントリポイントも含んでいます。
	|
	*/

	'public' => __DIR__.'/../public',

	/*
	|--------------------------------------------------------------------------
	| ベースパス
	|--------------------------------------------------------------------------
	|
	| ベースパスはLaravelをインストールした大本です。
	| 大抵の場合、この値を変更する必要はありません。
	| しかし、やむを得ず変更する場合は、注意深く行なってください。
	|
	*/

	'base' => __DIR__.'/..',

	/*
	|--------------------------------------------------------------------------
	| Storageパス
	|--------------------------------------------------------------------------
	|
	| StorageパスはLaravelにより、Bladeビューのキャッシュや、ログなどの
	| 情報を保存するために使用されます。アプリケーションのために
	| ディレクトリーの場所を変更したい場合は、このパスを修正してください。
	|
	*/

	'storage' => __DIR__.'/../app/storage',

);
