#!/usr/bin/env php
<?php

/*
|--------------------------------------------------------------------------
| メインのオートローダーの登録
|--------------------------------------------------------------------------
|
| コンポーサーは自動的に生成する便利なクラスローダーをアプリケーションに
| 提供しています。私達はそれを利用するだけです！そのスクリプトを
| ここで読み込んでいるので、「手動」によりクラスをロードすることに
| 心を煩わせる必要はありません。リラックスしていましょう。
|
*/

require __DIR__.'/bootstrap/autoload.php';

/*
|--------------------------------------------------------------------------
| 明かりを灯す
|--------------------------------------------------------------------------
|
| 私達はPHP開発に光を灯す必要があります。ですから明かりを灯しましょう。
| これはフレームワークのブートストラップで、準備は整っています。
| これをロードしアプリケーションを実行し、レスポンスを
| ブラウザに送り返すことで、ユーザーを喜ばせましょう。
|
*/

$app = require_once __DIR__.'/bootstrap/start.php';

$app->boot();

/*
|--------------------------------------------------------------------------
| Artisanコンソールアプリケーションをロードする
|--------------------------------------------------------------------------
|
| Artisanコンソールアプリケーションを実行するため、スクリプトをロードし
| それをリターンする必要があります。必要な場合にブラウザ経由でも
| コマンドを実行するためコマンドの実行とコンソールアプリケーションを独立させ
| ロードできるようにそれぞれを独自のスクリプトにしました。
|
*/

$artisan = Illuminate\Console\Application::start($app);

/*
|--------------------------------------------------------------------------
| Artisanアプリケーションの実行
|--------------------------------------------------------------------------
|
| コンソールアプリケーションを実行する時には、コンソールの中で現在の
| CLIコマンドが実行され、レスポンスが端末か開発者の他の出力装置に
| 送られます。何もする必要ありません！
|
*/

$status = $artisan->run();

/*
|--------------------------------------------------------------------------
| アプリケーションのシャットダウン
|--------------------------------------------------------------------------
|
| Artisanは一度実行されました。シャットダウンの手順を進める前に
| 後片付けをしてもらうため、シャットダウンイベントを発行します。
| これはリクエストの一番最後に起きます。
|
*/

$app->shutdown();

exit($status);