<?php

return array(

	/*
	|--------------------------------------------------------------------------
	| ワークベンチ作者名
	|--------------------------------------------------------------------------
	|
	| Artisan "workbench"コマンドで新しいパッケージを生成する時に
	| コンポーサーの.jsonファイルに追加するあなたの名前を指定する必要が
	| あります。ここに指定すれば、作成する全てのワークベンチに適用されます
	|
	*/

	'name' => '',

	/*
	|--------------------------------------------------------------------------
	| ワークベンチ作者メールアドレス
	|--------------------------------------------------------------------------
	|
	| 前のオプションと同様にメールアドレスも生成する新しいパッケージで
	| 使用されます。ベンチワークツールで作成されるパッケージの
	| composer.jsonファイル中でメールアドレスとして設定されます。
	|
	*/

	'email' => '',

);